//Сортировка массива в случайном порядке

let input = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];

const shuffle = (arr) => {
  for (let i = arr.length - 1; i > 0; i--) {
    let tmp = arr[i];
    let rnd = Math.floor(Math.random() * (i + 1));

    arr[i] = arr[rnd];
    arr[rnd] = tmp;
  }

  return arr;
};

for (let i = 0; i < 10; i++) {
 console.log(shuffle(input).join(','))
  
}
/*
3,8,10,5,6,2,1,9,4,7
6,5,7,4,9,2,3,10,1,8
5,10,8,6,4,3,1,2,9,7
1,10,8,9,4,7,2,3,5,6
1,8,9,5,3,2,4,6,10,7
1,2,6,10,8,3,4,9,5,7
3,8,10,5,4,7,6,2,1,9
2,6,3,9,8,10,7,5,4,1
8,6,9,3,1,10,4,5,7,2
9,10,2,1,3,6,7,4,5,8
*/